apache/mynewt-core/hw/mcu/stm/stm32h5xx/include/mcu/stm32_pin_cfg.h
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#ifndef _STM32_PIN_CFG_H
#define _STM32_PIN_CFG_H

#include <stdint.h>
#include <mcu/stm32_hal.h>

#ifdef __cplusplus
extern "C" {
#endif

typedef uint16_t hal_gpio_pin_t;
typedef const struct stm32_pin_cfg *stm32_pin_cfg_t;

struct stm32_pin_cfg {
    hal_gpio_pin_t pin;
    GPIO_InitTypeDef hal_init;
};

void stm32_pin_config(stm32_pin_cfg_t cfg);
void stm32_pin_pulse(hal_gpio_pin_t pin);
void stm32_pin_pulse_n(hal_gpio_pin_t pin, int pulse_count);

#define NULL_PIN NULL

/* Port definitions */
#ifdef GPIOA
#define PA0  MCU_GPIO_PORTA(0)
#define PA1  MCU_GPIO_PORTA(1)
#define PA2  MCU_GPIO_PORTA(2)
#define PA3  MCU_GPIO_PORTA(3)
#define PA4  MCU_GPIO_PORTA(4)
#define PA5  MCU_GPIO_PORTA(5)
#define PA6  MCU_GPIO_PORTA(6)
#define PA7  MCU_GPIO_PORTA(7)
#define PA8  MCU_GPIO_PORTA(8)
#define PA9  MCU_GPIO_PORTA(9)
#define PA10 MCU_GPIO_PORTA(10)
#define PA11 MCU_GPIO_PORTA(11)
#define PA12 MCU_GPIO_PORTA(12)
#define PA13 MCU_GPIO_PORTA(13)
#define PA14 MCU_GPIO_PORTA(14)
#define PA15 MCU_GPIO_PORTA(15)
#endif

#ifdef GPIOB
#define PB0  MCU_GPIO_PORTB(0)
#define PB1  MCU_GPIO_PORTB(1)
#define PB2  MCU_GPIO_PORTB(2)
#define PB3  MCU_GPIO_PORTB(3)
#define PB4  MCU_GPIO_PORTB(4)
#define PB5  MCU_GPIO_PORTB(5)
#define PB6  MCU_GPIO_PORTB(6)
#define PB7  MCU_GPIO_PORTB(7)
#define PB8  MCU_GPIO_PORTB(8)
#define PB9  MCU_GPIO_PORTB(9)
#define PB10 MCU_GPIO_PORTB(10)
#define PB11 MCU_GPIO_PORTB(11)
#define PB12 MCU_GPIO_PORTB(12)
#define PB13 MCU_GPIO_PORTB(13)
#define PB14 MCU_GPIO_PORTB(14)
#define PB15 MCU_GPIO_PORTB(15)
#endif

#ifdef GPIOC
#define PC0  MCU_GPIO_PORTC(0)
#define PC1  MCU_GPIO_PORTC(1)
#define PC2  MCU_GPIO_PORTC(2)
#define PC3  MCU_GPIO_PORTC(3)
#define PC4  MCU_GPIO_PORTC(4)
#define PC5  MCU_GPIO_PORTC(5)
#define PC6  MCU_GPIO_PORTC(6)
#define PC7  MCU_GPIO_PORTC(7)
#define PC8  MCU_GPIO_PORTC(8)
#define PC9  MCU_GPIO_PORTC(9)
#define PC10 MCU_GPIO_PORTC(10)
#define PC11 MCU_GPIO_PORTC(11)
#define PC12 MCU_GPIO_PORTC(12)
#define PC13 MCU_GPIO_PORTC(13)
#define PC14 MCU_GPIO_PORTC(14)
#define PC15 MCU_GPIO_PORTC(15)
#endif

#ifdef GPIOD
#define PD0  MCU_GPIO_PORTD(0)
#define PD1  MCU_GPIO_PORTD(1)
#define PD2  MCU_GPIO_PORTD(2)
#define PD3  MCU_GPIO_PORTD(3)
#define PD4  MCU_GPIO_PORTD(4)
#define PD5  MCU_GPIO_PORTD(5)
#define PD6  MCU_GPIO_PORTD(6)
#define PD7  MCU_GPIO_PORTD(7)
#define PD8  MCU_GPIO_PORTD(8)
#define PD9  MCU_GPIO_PORTD(9)
#define PD10 MCU_GPIO_PORTD(10)
#define PD11 MCU_GPIO_PORTD(11)
#define PD12 MCU_GPIO_PORTD(12)
#define PD13 MCU_GPIO_PORTD(13)
#define PD14 MCU_GPIO_PORTD(14)
#define PD15 MCU_GPIO_PORTD(15)
#endif

#ifdef GPIOE
#define PE0  MCU_GPIO_PORTE(0)
#define PE1  MCU_GPIO_PORTE(1)
#define PE2  MCU_GPIO_PORTE(2)
#define PE3  MCU_GPIO_PORTE(3)
#define PE4  MCU_GPIO_PORTE(4)
#define PE5  MCU_GPIO_PORTE(5)
#define PE6  MCU_GPIO_PORTE(6)
#define PE7  MCU_GPIO_PORTE(7)
#define PE8  MCU_GPIO_PORTE(8)
#define PE9  MCU_GPIO_PORTE(9)
#define PE10 MCU_GPIO_PORTE(10)
#define PE11 MCU_GPIO_PORTE(11)
#define PE12 MCU_GPIO_PORTE(12)
#define PE13 MCU_GPIO_PORTE(13)
#define PE14 MCU_GPIO_PORTE(14)
#define PE15 MCU_GPIO_PORTE(15)
#endif

#ifdef GPIOF
#define PF0  MCU_GPIO_PORTF(0)
#define PF1  MCU_GPIO_PORTF(1)
#define PF2  MCU_GPIO_PORTF(2)
#define PF3  MCU_GPIO_PORTF(3)
#define PF4  MCU_GPIO_PORTF(4)
#define PF5  MCU_GPIO_PORTF(5)
#define PF6  MCU_GPIO_PORTF(6)
#define PF7  MCU_GPIO_PORTF(7)
#define PF8  MCU_GPIO_PORTF(8)
#define PF9  MCU_GPIO_PORTF(9)
#define PF10 MCU_GPIO_PORTF(10)
#define PF11 MCU_GPIO_PORTF(11)
#define PF12 MCU_GPIO_PORTF(12)
#define PF13 MCU_GPIO_PORTF(13)
#define PF14 MCU_GPIO_PORTF(14)
#define PF15 MCU_GPIO_PORTF(15)
#endif

#ifdef GPIOG
#define PG0  MCU_GPIO_PORTG(0)
#define PG1  MCU_GPIO_PORTG(1)
#define PG2  MCU_GPIO_PORTG(2)
#define PG3  MCU_GPIO_PORTG(3)
#define PG4  MCU_GPIO_PORTG(4)
#define PG5  MCU_GPIO_PORTG(5)
#define PG6  MCU_GPIO_PORTG(6)
#define PG7  MCU_GPIO_PORTG(7)
#define PG8  MCU_GPIO_PORTG(8)
#define PG9  MCU_GPIO_PORTG(9)
#define PG10 MCU_GPIO_PORTG(10)
#define PG11 MCU_GPIO_PORTG(11)
#define PG12 MCU_GPIO_PORTG(12)
#define PG13 MCU_GPIO_PORTG(13)
#define PG14 MCU_GPIO_PORTG(14)
#define PG15 MCU_GPIO_PORTG(15)
#endif

#ifdef GPIOH
#define PH0  MCU_GPIO_PORTH(0)
#define PH1  MCU_GPIO_PORTH(1)
#define PH2  MCU_GPIO_PORTH(2)
#define PH3  MCU_GPIO_PORTH(3)
#define PH4  MCU_GPIO_PORTH(4)
#define PH5  MCU_GPIO_PORTH(5)
#define PH6  MCU_GPIO_PORTH(6)
#define PH7  MCU_GPIO_PORTH(7)
#define PH8  MCU_GPIO_PORTH(8)
#define PH9  MCU_GPIO_PORTH(9)
#define PH10 MCU_GPIO_PORTH(10)
#define PH11 MCU_GPIO_PORTH(11)
#define PH12 MCU_GPIO_PORTH(12)
#define PH13 MCU_GPIO_PORTH(13)
#define PH14 MCU_GPIO_PORTH(14)
#define PH15 MCU_GPIO_PORTH(15)
#endif

#ifdef GPIOI
#define PI0  MCU_GPIO_PORTI(0)
#define PI1  MCU_GPIO_PORTI(1)
#define PI2  MCU_GPIO_PORTI(2)
#define PI3  MCU_GPIO_PORTI(3)
#define PI4  MCU_GPIO_PORTI(4)
#define PI5  MCU_GPIO_PORTI(5)
#define PI6  MCU_GPIO_PORTI(6)
#define PI7  MCU_GPIO_PORTI(7)
#define PI8  MCU_GPIO_PORTI(8)
#define PI9  MCU_GPIO_PORTI(9)
#define PI10 MCU_GPIO_PORTI(10)
#define PI11 MCU_GPIO_PORTI(11)
#define PI12 MCU_GPIO_PORTI(12)
#define PI13 MCU_GPIO_PORTI(13)
#define PI14 MCU_GPIO_PORTI(14)
#define PI15 MCU_GPIO_PORTI(15)
#endif

#ifndef STM32_PIN_FUN_CFG

