apache/mynewt-core/hw/mcu/stm/stm32h5xx/include/mcu/stm32_pin_cfg.h
#define STM32_PIN_FUN_CFG(port_n, pin_n, pf, af) \
extern const struct stm32_pin_cfg _P##port_n##pin_n##_##pf;\
static stm32_pin_cfg_t const P##port_n##pin_n##_##pf __unused = &_P##port_n##pin_n##_##pf;

#define STM32_PIN_FUN_CFG_OD(port_n, pin_n, pf, af) \
extern const struct stm32_pin_cfg _P##port_n##pin_n##_##pf##_OD;\
static stm32_pin_cfg_t const P##port_n##pin_n##_##pf##_OD __unused = &_P##port_n##pin_n##_##pf##_OD;

#define STM32_PIN_FUN_CFG_OD_PU(port_n, pin_n, pf, af) \
extern const struct stm32_pin_cfg _P##port_n##pin_n##_##pf##_OD_PU;\
static stm32_pin_cfg_t const P##port_n##pin_n##_##pf##_OD_PU __unused = &_P##port_n##pin_n##_##pf##_OD_PU;

#endif

#ifdef GPIOA
#ifdef ETH
STM32_PIN_FUN_CFG(A, 0, ETH_CRS, GPIO_AF11_ETH)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(A, 0, SAI2_SD_B, GPIO_AF10_SAI2)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(A, 0, SDMMC2_CMD, GPIO_AF9_SDMMC2)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(A, 0, SPI3_RDY, GPIO_AF6_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(A, 0, SPI6_NSS, GPIO_AF5_SPI6)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(A, 0, TIM15_BKIN, GPIO_AF4_TIM15)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 0, TIM2_CH1, GPIO_AF1_TIM2)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 0, TIM2_ETR, GPIO_AF14_TIM2)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(A, 0, TIM5_CH1, GPIO_AF2_TIM5)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(A, 0, TIM8_ETR, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(A, 0, UART4_TX, GPIO_AF8_UART4)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 0, USART2_CTS, GPIO_AF7_USART2)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 0, USART2_NSS, GPIO_AF7_USART2)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 1, ETH_REF_CLK, GPIO_AF11_ETH)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 1, ETH_RX_CLK, GPIO_AF11_ETH)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(A, 1, LPTIM1_IN1, GPIO_AF5_LPTIM1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(A, 1, OCTOSPI1_DQS, GPIO_AF6_OCTOSPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(A, 1, OCTOSPI1_IO3, GPIO_AF9_OCTOSPI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(A, 1, SAI2_MCLK_B, GPIO_AF10_SAI2)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(A, 1, TIM15_CH1N, GPIO_AF4_TIM15)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 1, TIM2_CH2, GPIO_AF1_TIM2)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(A, 1, TIM5_CH2, GPIO_AF2_TIM5)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(A, 1, UART4_RX, GPIO_AF8_UART4)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 1, USART2_DE, GPIO_AF7_USART2)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 1, USART2_RTS, GPIO_AF7_USART2)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(A, 10, DCMI_D1, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN2
STM32_PIN_FUN_CFG(A, 10, FDCAN2_TX, GPIO_AF9_FDCAN2)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(A, 10, LPTIM2_IN2, GPIO_AF4_LPTIM2)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(A, 10, LPUART1_RX, GPIO_AF3_LPUART1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 10, PSSI_D1, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(A, 10, SDMMC1_D0, GPIO_AF12_SDMMC1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 10, TIM1_CH3, GPIO_AF1_TIM1)
#endif
#ifdef UCPD1
STM32_PIN_FUN_CFG(A, 10, UCPD1_FRSTX, GPIO_AF6_UCPD1)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 10, USART1_RX, GPIO_AF7_USART1)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(A, 11, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(A, 11, I2S2_WS, GPIO_AF5_SPI2)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(A, 11, LPUART1_CTS, GPIO_AF3_LPUART1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(A, 11, SPI2_NSS, GPIO_AF5_SPI2)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 11, TIM1_CH4, GPIO_AF1_TIM1)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(A, 11, UART4_RX, GPIO_AF6_UART4)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 11, USART1_CTS, GPIO_AF7_USART1)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 11, USART1_NSS, GPIO_AF7_USART1)
#endif
#ifdef USB
STM32_PIN_FUN_CFG(A, 11, USB_DM, GPIO_AF10_USB)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(A, 12, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(A, 12, I2S2_CK, GPIO_AF5_SPI2)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(A, 12, LPUART1_DE, GPIO_AF3_LPUART1)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(A, 12, LPUART1_RTS, GPIO_AF3_LPUART1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(A, 12, SAI2_FS_B, GPIO_AF8_SAI2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(A, 12, SPI2_SCK, GPIO_AF5_SPI2)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 12, TIM1_ETR, GPIO_AF1_TIM1)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(A, 12, UART4_TX, GPIO_AF6_UART4)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 12, USART1_DE, GPIO_AF7_USART1)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 12, USART1_RTS, GPIO_AF7_USART1)
#endif
#ifdef USB
STM32_PIN_FUN_CFG(A, 12, USB_DP, GPIO_AF10_USB)
#endif
#ifdef CEC
STM32_PIN_FUN_CFG(A, 15, CEC, GPIO_AF4_CEC)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(A, 15, DCMI_D11, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(A, 15, FMC_NBL1, GPIO_AF12_FMC)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(A, 15, I2S1_WS, GPIO_AF5_SPI1)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(A, 15, I2S3_WS, GPIO_AF6_SPI3)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(A, 15, LPTIM3_IN2, GPIO_AF2_LPTIM3)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 15, PSSI_D11, GPIO_AF13_PSSI)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(A, 15, SPI1_NSS, GPIO_AF5_SPI1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(A, 15, SPI3_NSS, GPIO_AF6_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(A, 15, SPI6_NSS, GPIO_AF7_SPI6)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 15, TIM2_CH1, GPIO_AF1_TIM2)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 15, TIM2_ETR, GPIO_AF14_TIM2)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(A, 15, UART4_DE, GPIO_AF8_UART4)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(A, 15, UART4_RTS, GPIO_AF8_UART4)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(A, 15, UART7_TX, GPIO_AF11_UART7)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 2, ETH_MDIO, GPIO_AF11_ETH)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(A, 2, LPTIM1_IN2, GPIO_AF5_LPTIM1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(A, 2, SAI2_SCK_B, GPIO_AF8_SAI2)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(A, 2, TIM15_CH1, GPIO_AF4_TIM15)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 2, TIM2_CH3, GPIO_AF1_TIM2)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(A, 2, TIM5_CH3, GPIO_AF2_TIM5)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 2, USART2_TX, GPIO_AF7_USART2)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 3, ETH_COL, GPIO_AF11_ETH)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(A, 3, I2S2_WS, GPIO_AF5_SPI2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(A, 3, OCTOSPI1_CLK, GPIO_AF3_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(A, 3, SAI1_SD_B, GPIO_AF6_SAI1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(A, 3, SPI2_NSS, GPIO_AF5_SPI2)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(A, 3, TIM15_CH2, GPIO_AF4_TIM15)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 3, TIM2_CH4, GPIO_AF1_TIM2)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(A, 3, TIM5_CH4, GPIO_AF2_TIM5)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 3, USART2_RX, GPIO_AF7_USART2)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(A, 4, DCMI_HSYNC, GPIO_AF13_DCMI)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(A, 4, I2S1_WS, GPIO_AF5_SPI1)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(A, 4, I2S3_WS, GPIO_AF6_SPI3)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(A, 4, LPTIM2_CH1, GPIO_AF3_LPTIM2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 4, PSSI_DE, GPIO_AF13_PSSI)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(A, 4, SPI1_NSS, GPIO_AF5_SPI1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(A, 4, SPI3_NSS, GPIO_AF6_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(A, 4, SPI6_NSS, GPIO_AF8_SPI6)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(A, 4, TIM5_ETR, GPIO_AF2_TIM5)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(A, 4, USART2_CK, GPIO_AF7_USART2)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 5, ETH_TX_EN, GPIO_AF11_ETH)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(A, 5, I2S1_CK, GPIO_AF5_SPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 5, PSSI_D14, GPIO_AF13_PSSI)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(A, 5, SPI1_SCK, GPIO_AF5_SPI1)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(A, 5, SPI6_SCK, GPIO_AF8_SPI6)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 5, TIM2_CH1, GPIO_AF1_TIM2)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(A, 5, TIM2_ETR, GPIO_AF14_TIM2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(A, 5, TIM8_CH1N, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(A, 6, DCMI_PIXCLK, GPIO_AF13_DCMI)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(A, 6, I2S1_SDI, GPIO_AF5_SPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(A, 6, OCTOSPI1_IO3, GPIO_AF6_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 6, PSSI_PDCK, GPIO_AF13_PSSI)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(A, 6, SPI1_MISO, GPIO_AF5_SPI1)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(A, 6, SPI6_MISO, GPIO_AF8_SPI6)
#endif
#ifdef TIM13
STM32_PIN_FUN_CFG(A, 6, TIM13_CH1, GPIO_AF9_TIM13)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 6, TIM1_BKIN, GPIO_AF1_TIM1)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(A, 6, TIM3_CH1, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(A, 6, TIM8_BKIN, GPIO_AF3_TIM8)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(A, 6, USART11_TX, GPIO_AF7_USART11)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 7, ETH_CRS_DV, GPIO_AF11_ETH)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 7, ETH_RX_DV, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(A, 7, FMC_NWE, GPIO_AF13_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(A, 7, FMC_SDNWE, GPIO_AF12_FMC)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(A, 7, I2S1_SDO, GPIO_AF5_SPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(A, 7, OCTOSPI1_IO2, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(A, 7, SPI1_MOSI, GPIO_AF5_SPI1)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(A, 7, SPI6_MOSI, GPIO_AF8_SPI6)
#endif
#ifdef TIM14
STM32_PIN_FUN_CFG(A, 7, TIM14_CH1, GPIO_AF9_TIM14)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 7, TIM1_CH1N, GPIO_AF1_TIM1)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(A, 7, TIM3_CH2, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(A, 7, TIM8_CH1N, GPIO_AF3_TIM8)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(A, 7, USART11_RX, GPIO_AF7_USART11)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(A, 8, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(A, 8, FMC_NOE, GPIO_AF12_FMC)
#endif
#ifdef I2C3
STM32_PIN_FUN_CFG(A, 8, I2C3_SCL, GPIO_AF4_I2C3)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 8, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef RCC
STM32_PIN_FUN_CFG(A, 8, RCC_MCO_1, GPIO_AF0_MCO)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(A, 8, SPI1_RDY, GPIO_AF5_SPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 8, TIM1_CH1, GPIO_AF1_TIM1)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(A, 8, TIM8_BKIN2, GPIO_AF3_TIM8)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(A, 8, UART7_RX, GPIO_AF11_UART7)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 8, USART1_CK, GPIO_AF7_USART1)
#endif
#ifdef USB
STM32_PIN_FUN_CFG(A, 8, USB_SOF, GPIO_AF10_USB)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(A, 9, DCMI_D0, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(A, 9, ETH_TX_ER, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(A, 9, FMC_NWE, GPIO_AF12_FMC)
#endif
#ifdef I2C3
STM32_PIN_FUN_CFG(A, 9, I2C3_SMBA, GPIO_AF4_I2C3)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(A, 9, I2S2_CK, GPIO_AF5_SPI2)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(A, 9, LPUART1_TX, GPIO_AF3_LPUART1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(A, 9, PSSI_D0, GPIO_AF13_PSSI)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(A, 9, SPI2_SCK, GPIO_AF5_SPI2)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(A, 9, TIM1_CH2, GPIO_AF1_TIM1)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(A, 9, USART1_TX, GPIO_AF7_USART1)
#endif
#endif /* GPIOA */

