apache/mynewt-core/hw/mcu/stm/stm32h5xx/include/mcu/stm32_pin_cfg.h
/* Port B definitions */
#ifdef GPIOB
#ifdef ETH
STM32_PIN_FUN_CFG(B, 0, ETH_RXD2, GPIO_AF11_ETH)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(B, 0, LPTIM3_CH1, GPIO_AF14_LPTIM3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 0, OCTOSPI1_IO1, GPIO_AF6_OCTOSPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(B, 0, TIM1_CH2N, GPIO_AF1_TIM1)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(B, 0, TIM3_CH3, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(B, 0, TIM8_CH2N, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(B, 0, UART4_CTS, GPIO_AF8_UART4)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(B, 0, USART11_CK, GPIO_AF7_USART11)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 1, ETH_RXD3, GPIO_AF11_ETH)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(B, 1, LPTIM3_CH2, GPIO_AF14_LPTIM3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 1, OCTOSPI1_IO0, GPIO_AF6_OCTOSPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(B, 1, TIM1_CH3N, GPIO_AF1_TIM1)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(B, 1, TIM3_CH4, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(B, 1, TIM8_CH3N, GPIO_AF3_TIM8)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 10, ETH_RX_ER, GPIO_AF11_ETH)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(B, 10, I2C2_SCL, GPIO_AF4_I2C2)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 10, I2S2_CK, GPIO_AF5_SPI2)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(B, 10, LPTIM2_IN1, GPIO_AF3_LPTIM2)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(B, 10, LPTIM3_CH1, GPIO_AF2_LPTIM3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 10, OCTOSPI1_NCS, GPIO_AF9_OCTOSPI1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 10, SPI2_SCK, GPIO_AF5_SPI2)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(B, 10, TIM2_CH3, GPIO_AF1_TIM2)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 10, USART3_TX, GPIO_AF7_USART3)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 11, ETH_TX_EN, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(B, 11, FMC_NBL1, GPIO_AF12_FMC)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(B, 11, I2C2_SDA, GPIO_AF4_I2C2)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(B, 11, LPTIM2_ETR, GPIO_AF3_LPTIM2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 11, SPI2_RDY, GPIO_AF5_SPI2)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(B, 11, SPI4_RDY, GPIO_AF6_SPI4)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(B, 11, TIM2_CH4, GPIO_AF1_TIM2)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 11, USART3_RX, GPIO_AF7_USART3)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 12, ETH_TXD0, GPIO_AF11_ETH)
#endif
#ifdef FDCAN2
STM32_PIN_FUN_CFG(B, 12, FDCAN2_RX, GPIO_AF9_FDCAN2)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(B, 12, I2C2_SDA, GPIO_AF4_I2C2)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 12, I2S2_WS, GPIO_AF5_SPI2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 12, OCTOSPI1_NCLK, GPIO_AF3_OCTOSPI1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 12, SPI2_NSS, GPIO_AF5_SPI2)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(B, 12, TIM1_BKIN, GPIO_AF1_TIM1)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(B, 12, UART5_RX, GPIO_AF14_UART5)
#endif
#ifdef UCPD1
STM32_PIN_FUN_CFG(B, 12, UCPD1_FRSTX, GPIO_AF6_UCPD1)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 12, USART3_CK, GPIO_AF7_USART3)
#endif
#ifdef FDCAN2
STM32_PIN_FUN_CFG(B, 13, FDCAN2_TX, GPIO_AF9_FDCAN2)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(B, 13, I2C2_SMBA, GPIO_AF4_I2C2)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 13, I2S2_CK, GPIO_AF5_SPI2)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(B, 13, LPTIM2_CH1, GPIO_AF3_LPTIM2)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(B, 13, LPTIM3_IN1, GPIO_AF2_LPTIM3)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(B, 13, SDMMC1_D0, GPIO_AF12_SDMMC1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 13, SPI2_SCK, GPIO_AF5_SPI2)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(B, 13, TIM1_CH1N, GPIO_AF1_TIM1)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(B, 13, UART5_TX, GPIO_AF14_UART5)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 13, USART3_CTS, GPIO_AF7_USART3)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 13, USART3_NSS, GPIO_AF7_USART3)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 14, I2S2_SDI, GPIO_AF5_SPI2)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(B, 14, LPTIM3_ETR, GPIO_AF14_LPTIM3)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 14, SDMMC2_D0, GPIO_AF9_SDMMC2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 14, SPI2_MISO, GPIO_AF5_SPI2)
#endif
#ifdef TIM12
STM32_PIN_FUN_CFG(B, 14, TIM12_CH1, GPIO_AF2_TIM12)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(B, 14, TIM1_CH2N, GPIO_AF1_TIM1)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(B, 14, TIM8_CH2N, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(B, 14, UART4_DE, GPIO_AF8_UART4)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(B, 14, UART4_RTS, GPIO_AF8_UART4)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(B, 14, USART1_TX, GPIO_AF4_USART1)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 14, USART3_DE, GPIO_AF7_USART3)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(B, 14, USART3_RTS, GPIO_AF7_USART3)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 15, DCMI_D2, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 15, ETH_TXD1, GPIO_AF11_ETH)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 15, I2S2_SDO, GPIO_AF5_SPI2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 15, OCTOSPI1_CLK, GPIO_AF10_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 15, PSSI_D2, GPIO_AF13_PSSI)
#endif
#ifdef RTC
STM32_PIN_FUN_CFG(B, 15, RTC_REFIN, GPIO_AF0_RTC_50Hz)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 15, SDMMC2_D1, GPIO_AF9_SDMMC2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 15, SPI2_MOSI, GPIO_AF5_SPI2)
#endif
#ifdef TIM12
STM32_PIN_FUN_CFG(B, 15, TIM12_CH2, GPIO_AF2_TIM12)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(B, 15, TIM1_CH3N, GPIO_AF1_TIM1)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(B, 15, TIM8_CH3N, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(B, 15, UART4_CTS, GPIO_AF8_UART4)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(B, 15, UART5_RX, GPIO_AF14_UART5)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(B, 15, USART11_CTS, GPIO_AF7_USART11)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(B, 15, USART11_NSS, GPIO_AF7_USART11)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(B, 15, USART1_RX, GPIO_AF4_USART1)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(B, 2, I2S3_SDO, GPIO_AF7_SPI3)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(B, 2, LPTIM1_CH1, GPIO_AF5_LPTIM1)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(B, 2, LPTIM5_ETR, GPIO_AF13_LPTIM5)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 2, OCTOSPI1_CLK, GPIO_AF9_OCTOSPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 2, OCTOSPI1_DQS, GPIO_AF10_OCTOSPI1)
#endif
#ifdef RTC
STM32_PIN_FUN_CFG(B, 2, RTC_OUT2, GPIO_AF0_RTC_50Hz)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(B, 2, SAI1_D1, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(B, 2, SAI1_SD_A, GPIO_AF6_SAI1)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(B, 2, SDMMC1_CMD, GPIO_AF12_SDMMC1)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(B, 2, SPI1_RDY, GPIO_AF4_SPI1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(B, 2, SPI3_MOSI, GPIO_AF7_SPI3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(B, 2, TIM8_CH4N, GPIO_AF3_TIM8)
#endif
#ifdef CRS
STM32_PIN_FUN_CFG(B, 3, CRS_SYNC, GPIO_AF10_CRS)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(B, 3, I2C2_SDA, GPIO_AF4_I2C2)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(B, 3, I2S1_CK, GPIO_AF5_SPI1)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(B, 3, I2S3_CK, GPIO_AF6_SPI3)
#endif
#ifdef LPTIM6
STM32_PIN_FUN_CFG(B, 3, LPTIM6_ETR, GPIO_AF14_LPTIM6)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 3, SDMMC2_D2, GPIO_AF9_SDMMC2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(B, 3, SPI1_SCK, GPIO_AF5_SPI1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(B, 3, SPI3_SCK, GPIO_AF6_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(B, 3, SPI6_SCK, GPIO_AF8_SPI6)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(B, 3, TIM2_CH2, GPIO_AF1_TIM2)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(B, 3, UART12_CTS, GPIO_AF7_UART12)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(B, 3, UART7_RX, GPIO_AF11_UART7)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 4, DCMI_D7, GPIO_AF13_DCMI)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(B, 4, I2S1_SDI, GPIO_AF5_SPI1)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 4, I2S2_WS, GPIO_AF7_SPI2)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(B, 4, I2S3_SDI, GPIO_AF6_SPI3)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(B, 4, LPTIM1_CH2, GPIO_AF4_LPTIM1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 4, OCTOSPI1_CLK, GPIO_AF3_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 4, PSSI_D7, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 4, SDMMC2_D3, GPIO_AF9_SDMMC2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(B, 4, SPI1_MISO, GPIO_AF5_SPI1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 4, SPI2_NSS, GPIO_AF7_SPI2)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(B, 4, SPI3_MISO, GPIO_AF6_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(B, 4, SPI6_MISO, GPIO_AF8_SPI6)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(B, 4, TIM16_BKIN, GPIO_AF1_TIM16)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(B, 4, TIM3_CH1, GPIO_AF2_TIM3)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(B, 4, UART7_TX, GPIO_AF11_UART7)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 5, DCMI_D10, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 5, ETH_PPS_OUT, GPIO_AF11_ETH)
#endif
#ifdef FDCAN2
STM32_PIN_FUN_CFG(B, 5, FDCAN2_RX, GPIO_AF9_FDCAN2)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(B, 5, FMC_SDCKE1, GPIO_AF12_FMC)
#endif
#ifdef I2C1
STM32_PIN_FUN_CFG(B, 5, I2C1_SMBA, GPIO_AF4_I2C1)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(B, 5, I2C4_SMBA, GPIO_AF6_I2C4)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(B, 5, I2S1_SDO, GPIO_AF5_SPI1)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(B, 5, I2S3_SDO, GPIO_AF7_SPI3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 5, OCTOSPI1_NCLK, GPIO_AF3_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 5, PSSI_D10, GPIO_AF13_PSSI)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(B, 5, SPI1_MOSI, GPIO_AF5_SPI1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(B, 5, SPI3_MOSI, GPIO_AF7_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(B, 5, SPI6_MOSI, GPIO_AF8_SPI6)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(B, 5, TIM17_BKIN, GPIO_AF1_TIM17)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(B, 5, TIM3_CH2, GPIO_AF2_TIM3)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(B, 5, UART5_RX, GPIO_AF14_UART5)
#endif
#ifdef CEC
STM32_PIN_FUN_CFG(B, 6, CEC, GPIO_AF5_CEC)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 6, DCMI_D5, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN2
STM32_PIN_FUN_CFG(B, 6, FDCAN2_TX, GPIO_AF9_FDCAN2)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(B, 6, FMC_SDNE1, GPIO_AF12_FMC)
#endif
#ifdef I2C1
STM32_PIN_FUN_CFG(B, 6, I2C1_SCL, GPIO_AF4_I2C1)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(B, 6, I2C4_SCL, GPIO_AF6_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(B, 6, I3C1_SCL, GPIO_AF3_I3C1)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(B, 6, LPUART1_TX, GPIO_AF8_LPUART1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(B, 6, OCTOSPI1_NCS, GPIO_AF10_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 6, PSSI_D5, GPIO_AF13_PSSI)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(B, 6, TIM16_CH1N, GPIO_AF1_TIM16)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(B, 6, TIM4_CH1, GPIO_AF2_TIM4)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(B, 6, UART5_TX, GPIO_AF14_UART5)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(B, 6, USART1_TX, GPIO_AF7_USART1)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 7, DCMI_VSYNC, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(B, 7, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(B, 7, FMC_NL, GPIO_AF12_FMC)
#endif
#ifdef I2C1
STM32_PIN_FUN_CFG(B, 7, I2C1_SDA, GPIO_AF4_I2C1)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(B, 7, I2C4_SDA, GPIO_AF6_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(B, 7, I3C1_SDA, GPIO_AF3_I3C1)
#endif
#ifdef LPUART1
STM32_PIN_FUN_CFG(B, 7, LPUART1_RX, GPIO_AF8_LPUART1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 7, PSSI_RDY, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 7, SDMMC2_CKIN, GPIO_AF11_SDMMC2)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 7, SDMMC2_D5, GPIO_AF10_SDMMC2)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(B, 7, TIM17_CH1N, GPIO_AF1_TIM17)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(B, 7, TIM4_CH2, GPIO_AF2_TIM4)
#endif
#ifdef USART1
STM32_PIN_FUN_CFG(B, 7, USART1_RX, GPIO_AF7_USART1)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 8, DCMI_D6, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(B, 8, ETH_TXD3, GPIO_AF11_ETH)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(B, 8, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef I2C1
STM32_PIN_FUN_CFG(B, 8, I2C1_SCL, GPIO_AF4_I2C1)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(B, 8, I2C4_SCL, GPIO_AF6_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(B, 8, I3C1_SCL, GPIO_AF3_I3C1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 8, PSSI_D6, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(B, 8, SDMMC1_CKIN, GPIO_AF7_SDMMC1)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(B, 8, SDMMC1_D4, GPIO_AF12_SDMMC1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 8, SDMMC2_D4, GPIO_AF10_SDMMC2)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(B, 8, SPI4_RDY, GPIO_AF5_SPI4)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(B, 8, TIM16_CH1, GPIO_AF1_TIM16)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(B, 8, TIM4_CH3, GPIO_AF2_TIM4)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(B, 8, UART4_RX, GPIO_AF8_UART4)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(B, 9, DCMI_D7, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(B, 9, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef I2C1
STM32_PIN_FUN_CFG(B, 9, I2C1_SDA, GPIO_AF4_I2C1)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(B, 9, I2C4_SDA, GPIO_AF6_I2C4)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(B, 9, I2S2_WS, GPIO_AF5_SPI2)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(B, 9, I3C1_SDA, GPIO_AF3_I3C1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(B, 9, PSSI_D7, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(B, 9, SDMMC1_CDIR, GPIO_AF7_SDMMC1)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(B, 9, SDMMC1_D5, GPIO_AF12_SDMMC1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 9, SDMMC2_CKIN, GPIO_AF11_SDMMC2)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(B, 9, SDMMC2_D5, GPIO_AF10_SDMMC2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(B, 9, SPI2_NSS, GPIO_AF5_SPI2)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(B, 9, TIM17_CH1, GPIO_AF1_TIM17)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(B, 9, TIM4_CH4, GPIO_AF2_TIM4)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(B, 9, UART4_TX, GPIO_AF8_UART4)
#endif
#endif /* GPIOB */

/* Port C definitions */
#ifdef GPIOC
#ifdef FMC
STM32_PIN_FUN_CFG(C, 0, FMC_A25, GPIO_AF9_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 0, FMC_SDNWE, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 0, OCTOSPI1_IO7, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 0, SAI1_MCLK_A, GPIO_AF6_SAI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(C, 0, SAI2_FS_B, GPIO_AF8_SAI2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(C, 0, SPI2_RDY, GPIO_AF7_SPI2)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(C, 0, TIM16_BKIN, GPIO_AF1_TIM16)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(C, 1, ETH_MDC, GPIO_AF11_ETH)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(C, 1, I2S2_SDO, GPIO_AF5_SPI2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 1, OCTOSPI1_IO4, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 1, SAI1_D1, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 1, SAI1_SD_A, GPIO_AF6_SAI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(C, 1, SAI2_SD_A, GPIO_AF8_SAI2)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(C, 1, SDMMC2_CK, GPIO_AF9_SDMMC2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(C, 1, SPI2_MOSI, GPIO_AF5_SPI2)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(C, 1, USART11_DE, GPIO_AF7_USART11)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(C, 1, USART11_RTS, GPIO_AF7_USART11)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 10, DCMI_D8, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(C, 10, ETH_TXD0, GPIO_AF11_ETH)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(C, 10, I2S3_CK, GPIO_AF6_SPI3)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(C, 10, LPTIM3_ETR, GPIO_AF2_LPTIM3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 10, OCTOSPI1_IO1, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 10, PSSI_D8, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 10, SDMMC1_D2, GPIO_AF12_SDMMC1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(C, 10, SPI3_SCK, GPIO_AF6_SPI3)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(C, 10, UART4_TX, GPIO_AF8_UART4)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(C, 10, USART3_TX, GPIO_AF7_USART3)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 11, DCMI_D4, GPIO_AF13_DCMI)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(C, 11, I2S3_SDI, GPIO_AF6_SPI3)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(C, 11, LPTIM3_IN1, GPIO_AF2_LPTIM3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 11, OCTOSPI1_NCS, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 11, PSSI_D4, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 11, SDMMC1_D3, GPIO_AF12_SDMMC1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(C, 11, SPI3_MISO, GPIO_AF6_SPI3)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(C, 11, UART4_RX, GPIO_AF8_UART4)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(C, 11, USART3_RX, GPIO_AF7_USART3)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 12, DCMI_D9, GPIO_AF13_DCMI)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(C, 12, I2S3_SDO, GPIO_AF6_SPI3)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 12, PSSI_D9, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 12, SDMMC1_CK, GPIO_AF12_SDMMC1)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(C, 12, SPI3_MOSI, GPIO_AF6_SPI3)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(C, 12, SPI6_SCK, GPIO_AF5_SPI6)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(C, 12, TIM15_CH1, GPIO_AF2_TIM15)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(C, 12, UART5_TX, GPIO_AF8_UART5)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(C, 12, USART3_CK, GPIO_AF7_USART3)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(C, 2, ETH_TXD2, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 2, FMC_SDNE0, GPIO_AF12_FMC)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(C, 2, I2S2_SDI, GPIO_AF5_SPI2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 2, OCTOSPI1_IO2, GPIO_AF9_OCTOSPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 2, OCTOSPI1_IO5, GPIO_AF6_OCTOSPI1)
#endif
#ifdef PWR
STM32_PIN_FUN_CFG(C, 2, PWR_CSLEEP, GPIO_AF0_CSLEEP)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(C, 2, SPI2_MISO, GPIO_AF5_SPI2)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(C, 2, TIM17_CH1, GPIO_AF1_TIM17)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(C, 2, TIM4_CH4, GPIO_AF2_TIM4)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(C, 3, ETH_TX_CLK, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 3, FMC_SDCKE0, GPIO_AF12_FMC)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(C, 3, I2S2_SDO, GPIO_AF5_SPI2)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(C, 3, LPTIM3_CH1, GPIO_AF3_LPTIM3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 3, OCTOSPI1_IO0, GPIO_AF9_OCTOSPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 3, OCTOSPI1_IO6, GPIO_AF6_OCTOSPI1)
#endif
#ifdef PWR
STM32_PIN_FUN_CFG(C, 3, PWR_CSTOP, GPIO_AF0_CSTOP)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 3, SAI1_D3, GPIO_AF2_SAI1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(C, 3, SPI2_MOSI, GPIO_AF5_SPI2)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(C, 4, ETH_RXD0, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 4, FMC_SDNE0, GPIO_AF12_FMC)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(C, 4, I2S1_MCK, GPIO_AF5_SPI1)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(C, 4, LPTIM2_ETR, GPIO_AF3_LPTIM2)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 4, SAI1_CK1, GPIO_AF2_SAI1)
#endif
#ifdef TIM2
STM32_PIN_FUN_CFG(C, 4, TIM2_CH4, GPIO_AF1_TIM2)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(C, 4, USART3_RX, GPIO_AF7_USART3)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(C, 5, ETH_RXD1, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 5, FMC_SDCKE0, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 5, OCTOSPI1_DQS, GPIO_AF10_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 5, PSSI_D15, GPIO_AF4_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 5, SAI1_D3, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 5, SAI1_FS_A, GPIO_AF6_SAI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(C, 5, TIM1_CH4N, GPIO_AF1_TIM1)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(C, 5, UART12_DE, GPIO_AF7_UART12)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(C, 5, UART12_RTS, GPIO_AF7_UART12)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 6, DCMI_D0, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 6, FMC_NWAIT, GPIO_AF9_FMC)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(C, 6, I2S2_MCK, GPIO_AF5_SPI2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 6, OCTOSPI1_IO5, GPIO_AF11_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 6, PSSI_D0, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(C, 6, SAI1_SCK_A, GPIO_AF6_SAI1)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 6, SDMMC1_D0DIR, GPIO_AF8_SDMMC1)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 6, SDMMC1_D6, GPIO_AF12_SDMMC1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(C, 6, SDMMC2_D6, GPIO_AF10_SDMMC2)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(C, 6, TIM3_CH1, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(C, 6, TIM8_CH1, GPIO_AF3_TIM8)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(C, 6, USART6_TX, GPIO_AF7_USART6)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 7, DCMI_D1, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 7, FMC_NE1, GPIO_AF9_FMC)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(C, 7, I2S3_MCK, GPIO_AF6_SPI3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 7, OCTOSPI1_IO6, GPIO_AF11_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 7, PSSI_D1, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 7, SDMMC1_D123DIR, GPIO_AF8_SDMMC1)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 7, SDMMC1_D7, GPIO_AF12_SDMMC1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(C, 7, SDMMC2_D7, GPIO_AF10_SDMMC2)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(C, 7, TIM3_CH2, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(C, 7, TIM8_CH2, GPIO_AF3_TIM8)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(C, 7, USART6_RX, GPIO_AF7_USART6)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 8, DCMI_D2, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 8, FMC_ALE, GPIO_AF11_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 8, FMC_INT, GPIO_AF10_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 8, FMC_NCE, GPIO_AF9_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 8, FMC_NE2, GPIO_AF9_FMC)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 8, PSSI_D2, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 8, SDMMC1_D0, GPIO_AF12_SDMMC1)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(C, 8, TIM3_CH3, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(C, 8, TIM8_CH3, GPIO_AF3_TIM8)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(C, 8, UART5_DE, GPIO_AF8_UART5)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(C, 8, UART5_RTS, GPIO_AF8_UART5)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(C, 8, USART6_CK, GPIO_AF7_USART6)
#endif
#ifdef AUDIOCLK
STM32_PIN_FUN_CFG(C, 9, AUDIOCLK, GPIO_AF5_SPI1)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(C, 9, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(C, 9, FMC_CLE, GPIO_AF11_FMC)
#endif
#ifdef I2C3
STM32_PIN_FUN_CFG(C, 9, I2C3_SDA, GPIO_AF4_I2C3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(C, 9, OCTOSPI1_IO0, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(C, 9, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef RCC
STM32_PIN_FUN_CFG(C, 9, RCC_MCO_2, GPIO_AF0_MCO)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(C, 9, SDMMC1_D1, GPIO_AF12_SDMMC1)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(C, 9, TIM3_CH4, GPIO_AF2_TIM3)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(C, 9, TIM8_CH4, GPIO_AF3_TIM8)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(C, 9, UART5_CTS, GPIO_AF8_UART5)
#endif
#endif /* GPIOC */

