apache/mynewt-core/hw/mcu/stm/stm32h5xx/include/mcu/stm32_pin_cfg.h
/* Port D definitions */
#ifdef GPIOD
#ifdef FDCAN1
STM32_PIN_FUN_CFG(D, 0, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 0, FMC_D2, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 0, FMC_DA2, GPIO_AF12_FMC)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(D, 0, TIM8_CH4N, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(D, 0, UART4_RX, GPIO_AF8_UART4)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(D, 0, UART9_CTS, GPIO_AF11_UART9)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(D, 1, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 1, FMC_D3, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 1, FMC_DA3, GPIO_AF12_FMC)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(D, 1, UART4_TX, GPIO_AF8_UART4)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(D, 2, DCMI_D11, GPIO_AF13_DCMI)
#endif
#ifdef LPTIM4
STM32_PIN_FUN_CFG(D, 2, LPTIM4_ETR, GPIO_AF14_LPTIM4)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(D, 2, PSSI_D11, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC1
STM32_PIN_FUN_CFG(D, 2, SDMMC1_CMD, GPIO_AF12_SDMMC1)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(D, 2, TIM15_BKIN, GPIO_AF4_TIM15)
#endif
#ifdef TIM3
STM32_PIN_FUN_CFG(D, 2, TIM3_ETR, GPIO_AF2_TIM3)
#endif
#ifdef UART5
STM32_PIN_FUN_CFG(D, 2, UART5_RX, GPIO_AF8_UART5)
#endif
#ifndef STM32H5
#ifdef DCMI
STM32_PIN_FUN_CFG(D, 3, DCMI_D5, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 3, FMC_CLK, GPIO_AF12_FMC)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(D, 3, I2S2_CK, GPIO_AF5_SPI2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(D, 3, PSSI_D5, GPIO_AF13_PSSI)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(D, 3, SPI2_SCK, GPIO_AF5_SPI2)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 3, USART2_CTS, GPIO_AF7_USART2)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 3, USART2_NSS, GPIO_AF7_USART2)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 4, FMC_NOE, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 4, OCTOSPI1_IO4, GPIO_AF10_OCTOSPI1)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 4, USART2_DE, GPIO_AF7_USART2)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 4, USART2_RTS, GPIO_AF7_USART2)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(D, 5, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 5, FMC_NWE, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 5, OCTOSPI1_IO5, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(D, 5, SPI2_RDY, GPIO_AF5_SPI2)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(D, 5, TIM1_CH4N, GPIO_AF1_TIM1)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 5, USART2_TX, GPIO_AF7_USART2)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(D, 6, DCMI_D10, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 6, FMC_NWAIT, GPIO_AF12_FMC)
#endif
#ifdef I2S3
STM32_PIN_FUN_CFG(D, 6, I2S3_SDO, GPIO_AF5_SPI3)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 6, OCTOSPI1_IO6, GPIO_AF10_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(D, 6, PSSI_D10, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(D, 6, SAI1_D1, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(D, 6, SAI1_SD_A, GPIO_AF6_SAI1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(D, 6, SDMMC2_CK, GPIO_AF11_SDMMC2)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(D, 6, SPI3_MOSI, GPIO_AF5_SPI3)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 6, USART2_RX, GPIO_AF7_USART2)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 7, FMC_NCE, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 7, FMC_NE1, GPIO_AF12_FMC)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(D, 7, I2S1_SDO, GPIO_AF5_SPI1)
#endif
#ifdef LPTIM4
STM32_PIN_FUN_CFG(D, 7, LPTIM4_OUT, GPIO_AF14_LPTIM4)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 7, OCTOSPI1_IO7, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(D, 7, SDMMC2_CMD, GPIO_AF11_SDMMC2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(D, 7, SPI1_MOSI, GPIO_AF5_SPI1)
#endif
#ifdef USART2
STM32_PIN_FUN_CFG(D, 7, USART2_CK, GPIO_AF7_USART2)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 8, FMC_D13, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 8, FMC_DA13, GPIO_AF12_FMC)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 8, USART3_TX, GPIO_AF7_USART3)
#endif
#ifdef FDCAN2
STM32_PIN_FUN_CFG(D, 9, FDCAN2_RX, GPIO_AF9_FDCAN2)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 9, FMC_D14, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 9, FMC_DA14, GPIO_AF12_FMC)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 9, USART3_RX, GPIO_AF7_USART3)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 10, FMC_D15, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 10, FMC_DA15, GPIO_AF12_FMC)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(D, 10, LPTIM2_CH2, GPIO_AF3_LPTIM2)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 10, USART3_CK, GPIO_AF7_USART3)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 11, FMC_A16, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 11, FMC_CLE, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(D, 11, I2C4_SMBA, GPIO_AF4_I2C4)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(D, 11, LPTIM2_IN2, GPIO_AF3_LPTIM2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 11, OCTOSPI1_IO0, GPIO_AF9_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(D, 11, SAI1_CK1, GPIO_AF2_SAI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(D, 11, SAI2_SD_A, GPIO_AF10_SAI2)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(D, 11, UART4_RX, GPIO_AF8_UART4)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 11, USART3_CTS, GPIO_AF7_USART3)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 11, USART3_NSS, GPIO_AF7_USART3)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(D, 12, DCMI_D12, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 12, FMC_A17, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 12, FMC_ALE, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(D, 12, I2C4_SCL, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(D, 12, I3C1_SCL, GPIO_AF5_I3C1)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(D, 12, LPTIM1_IN1, GPIO_AF1_LPTIM1)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(D, 12, LPTIM2_IN1, GPIO_AF3_LPTIM2)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 12, OCTOSPI1_IO1, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(D, 12, PSSI_D12, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(D, 12, SAI1_D1, GPIO_AF6_SAI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(D, 12, SAI2_FS_A, GPIO_AF10_SAI2)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(D, 12, TIM4_CH1, GPIO_AF2_TIM4)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(D, 12, UART4_TX, GPIO_AF8_UART4)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 12, USART3_DE, GPIO_AF7_USART3)
#endif
#ifdef USART3
STM32_PIN_FUN_CFG(D, 12, USART3_RTS, GPIO_AF7_USART3)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(D, 13, DCMI_D13, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 13, FMC_A18, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(D, 13, I2C4_SDA, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(D, 13, I3C1_SDA, GPIO_AF5_I3C1)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(D, 13, LPTIM1_CH1, GPIO_AF1_LPTIM1)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(D, 13, LPTIM2_CH1, GPIO_AF3_LPTIM2)
#endif
#ifdef LPTIM4
STM32_PIN_FUN_CFG(D, 13, LPTIM4_IN1, GPIO_AF14_LPTIM4)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(D, 13, OCTOSPI1_IO3, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(D, 13, PSSI_D13, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(D, 13, SAI2_SCK_A, GPIO_AF10_SAI2)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(D, 13, TIM4_CH2, GPIO_AF2_TIM4)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(D, 13, UART9_DE, GPIO_AF11_UART9)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(D, 13, UART9_RTS, GPIO_AF11_UART9)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 14, FMC_D0, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 14, FMC_DA0, GPIO_AF12_FMC)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(D, 14, TIM4_CH3, GPIO_AF2_TIM4)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(D, 14, UART8_CTS, GPIO_AF8_UART8)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(D, 14, UART9_RX, GPIO_AF11_UART9)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 15, FMC_D1, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(D, 15, FMC_DA1, GPIO_AF12_FMC)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(D, 15, TIM4_CH4, GPIO_AF2_TIM4)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(D, 15, UART8_DE, GPIO_AF8_UART8)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(D, 15, UART8_RTS, GPIO_AF8_UART8)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(D, 15, UART9_TX, GPIO_AF11_UART9)
#endif
#endif
#endif /* GPIOD */

/* Port E definitions */
#ifdef GPIOE
#ifdef DCMI
STM32_PIN_FUN_CFG(E, 0, DCMI_D2, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(E, 0, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 0, FMC_NBL0, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(E, 0, LPTIM1_ETR, GPIO_AF1_LPTIM1)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(E, 0, LPTIM2_CH2, GPIO_AF3_LPTIM2)
#endif
#ifdef LPTIM2
STM32_PIN_FUN_CFG(E, 0, LPTIM2_ETR, GPIO_AF4_LPTIM2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(E, 0, PSSI_D2, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(E, 0, SAI2_MCLK_A, GPIO_AF10_SAI2)
#endif
#ifdef SPI3
STM32_PIN_FUN_CFG(E, 0, SPI3_RDY, GPIO_AF6_SPI3)
#endif
#ifdef TIM4
STM32_PIN_FUN_CFG(E, 0, TIM4_ETR, GPIO_AF2_TIM4)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(E, 0, UART8_RX, GPIO_AF8_UART8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(E, 1, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(E, 1, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 1, FMC_NBL1, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(E, 1, LPTIM1_IN2, GPIO_AF1_LPTIM1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(E, 1, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(E, 1, UART8_TX, GPIO_AF8_UART8)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 10, FMC_D7, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 10, FMC_DA7, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(E, 10, OCTOSPI1_IO7, GPIO_AF10_OCTOSPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 10, TIM1_CH2N, GPIO_AF1_TIM1)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(E, 10, UART12_TX, GPIO_AF6_UART12)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(E, 10, UART7_CTS, GPIO_AF7_UART7)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 11, FMC_D8, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 11, FMC_DA8, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(E, 11, OCTOSPI1_NCS, GPIO_AF6_OCTOSPI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(E, 11, SAI2_SD_B, GPIO_AF10_SAI2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(E, 11, SPI1_RDY, GPIO_AF4_SPI1)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 11, SPI4_NSS, GPIO_AF5_SPI4)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 11, TIM1_CH2, GPIO_AF1_TIM1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 12, FMC_D9, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 12, FMC_DA9, GPIO_AF12_FMC)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(E, 12, SAI2_SCK_B, GPIO_AF10_SAI2)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 12, SPI4_SCK, GPIO_AF5_SPI4)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 12, TIM1_CH3N, GPIO_AF1_TIM1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 13, FMC_D10, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 13, FMC_DA10, GPIO_AF12_FMC)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(E, 13, SAI2_FS_B, GPIO_AF10_SAI2)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 13, SPI4_MISO, GPIO_AF5_SPI4)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 13, TIM1_CH3, GPIO_AF1_TIM1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 14, FMC_D11, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 14, FMC_DA11, GPIO_AF12_FMC)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(E, 14, SAI2_MCLK_B, GPIO_AF10_SAI2)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 14, SPI4_MOSI, GPIO_AF5_SPI4)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 14, TIM1_CH4, GPIO_AF1_TIM1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 15, FMC_D12, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 15, FMC_DA12, GPIO_AF12_FMC)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 15, TIM1_BKIN, GPIO_AF1_TIM1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 15, TIM1_CH4N, GPIO_AF3_TIM1)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(E, 15, USART10_CK, GPIO_AF7_USART10)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(E, 2, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(E, 2, ETH_TXD3, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 2, FMC_A23, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(E, 2, LPTIM1_IN2, GPIO_AF1_LPTIM1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(E, 2, OCTOSPI1_IO2, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(E, 2, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 2, SAI1_CK1, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 2, SAI1_MCLK_A, GPIO_AF6_SAI1)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 2, SPI4_SCK, GPIO_AF5_SPI4)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(E, 2, UART8_TX, GPIO_AF8_UART8)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(E, 2, USART10_RX, GPIO_AF7_USART10)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 3, FMC_A19, GPIO_AF12_FMC)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 3, SAI1_SD_B, GPIO_AF6_SAI1)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(E, 3, TIM15_BKIN, GPIO_AF4_TIM15)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(E, 3, USART10_TX, GPIO_AF7_USART10)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(E, 4, DCMI_D4, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 4, FMC_A20, GPIO_AF12_FMC)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(E, 4, PSSI_D4, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 4, SAI1_D2, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 4, SAI1_FS_A, GPIO_AF6_SAI1)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 4, SPI4_NSS, GPIO_AF5_SPI4)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(E, 4, TIM15_CH1N, GPIO_AF4_TIM15)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(E, 5, DCMI_D6, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 5, FMC_A21, GPIO_AF12_FMC)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(E, 5, PSSI_D6, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 5, SAI1_CK2, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 5, SAI1_SCK_A, GPIO_AF6_SAI1)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 5, SPI4_MISO, GPIO_AF5_SPI4)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(E, 5, TIM15_CH1, GPIO_AF4_TIM15)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(E, 6, DCMI_D7, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 6, FMC_A22, GPIO_AF12_FMC)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(E, 6, PSSI_D7, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 6, SAI1_D1, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(E, 6, SAI1_SD_A, GPIO_AF6_SAI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(E, 6, SAI2_MCLK_B, GPIO_AF10_SAI2)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(E, 6, SPI4_MOSI, GPIO_AF5_SPI4)
#endif
#ifdef TIM15
STM32_PIN_FUN_CFG(E, 6, TIM15_CH2, GPIO_AF4_TIM15)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 6, TIM1_BKIN2, GPIO_AF1_TIM1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 7, FMC_D4, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 7, FMC_DA4, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(E, 7, OCTOSPI1_IO4, GPIO_AF10_OCTOSPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 7, TIM1_ETR, GPIO_AF1_TIM1)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(E, 7, UART12_DE, GPIO_AF6_UART12)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(E, 7, UART12_RTS, GPIO_AF6_UART12)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(E, 7, UART7_RX, GPIO_AF7_UART7)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 8, FMC_D5, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 8, FMC_DA5, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(E, 8, OCTOSPI1_IO5, GPIO_AF10_OCTOSPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 8, TIM1_CH1N, GPIO_AF1_TIM1)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(E, 8, UART12_CTS, GPIO_AF6_UART12)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(E, 8, UART7_TX, GPIO_AF7_UART7)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 9, FMC_D6, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(E, 9, FMC_DA6, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(E, 9, OCTOSPI1_IO6, GPIO_AF10_OCTOSPI1)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(E, 9, TIM1_CH1, GPIO_AF1_TIM1)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(E, 9, UART12_RX, GPIO_AF6_UART12)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(E, 9, UART7_DE, GPIO_AF7_UART7)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(E, 9, UART7_RTS, GPIO_AF7_UART7)
#endif
#endif /* GPIOE */

/* Port F definitions */
#ifdef GPIOF
#ifdef FMC
STM32_PIN_FUN_CFG(F, 0, FMC_A0, GPIO_AF12_FMC)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(F, 0, I2C2_SDA, GPIO_AF4_I2C2)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 0, LPTIM5_CH1, GPIO_AF13_LPTIM5)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 1, FMC_A1, GPIO_AF12_FMC)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(F, 1, I2C2_SCL, GPIO_AF4_I2C2)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 1, LPTIM5_CH2, GPIO_AF13_LPTIM5)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(F, 10, DCMI_D11, GPIO_AF13_DCMI)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(F, 10, OCTOSPI1_CLK, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(F, 10, PSSI_D11, GPIO_AF13_PSSI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(F, 10, PSSI_D15, GPIO_AF4_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(F, 10, SAI1_D3, GPIO_AF2_SAI1)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(F, 10, TIM16_BKIN, GPIO_AF1_TIM16)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(F, 11, DCMI_D12, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 11, FMC_SDNRAS, GPIO_AF12_FMC)
#endif
#ifdef LPTIM6
STM32_PIN_FUN_CFG(F, 11, LPTIM6_CH1, GPIO_AF14_LPTIM6)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(F, 11, OCTOSPI1_NCLK, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(F, 11, PSSI_D12, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(F, 11, SAI2_SD_B, GPIO_AF10_SAI2)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(F, 11, SPI5_MOSI, GPIO_AF5_SPI5)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 12, FMC_A6, GPIO_AF12_FMC)
#endif
#ifdef LPTIM6
STM32_PIN_FUN_CFG(F, 12, LPTIM6_CH2, GPIO_AF14_LPTIM6)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 13, FMC_A7, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(F, 13, I2C4_SMBA, GPIO_AF4_I2C4)
#endif
#ifdef LPTIM6
STM32_PIN_FUN_CFG(F, 13, LPTIM6_IN1, GPIO_AF14_LPTIM6)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 14, FMC_A8, GPIO_AF12_FMC)
#endif
#ifdef LPTIM6
STM32_PIN_FUN_CFG(F, 14, LPTIM6_IN2, GPIO_AF14_LPTIM6)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 15, FMC_A9, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(F, 15, I2C4_SDA, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(F, 15, I3C1_SDA, GPIO_AF5_I3C1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 2, FMC_A2, GPIO_AF12_FMC)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(F, 2, I2C2_SMBA, GPIO_AF4_I2C2)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(F, 2, LPTIM3_CH2, GPIO_AF2_LPTIM3)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(F, 2, LPTIM3_IN2, GPIO_AF3_LPTIM3)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 2, LPTIM5_IN1, GPIO_AF13_LPTIM5)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(F, 2, UART12_TX, GPIO_AF6_UART12)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(F, 2, USART11_CK, GPIO_AF7_USART11)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 3, FMC_A3, GPIO_AF12_FMC)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(F, 3, LPTIM3_IN1, GPIO_AF2_LPTIM3)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 3, LPTIM5_IN2, GPIO_AF13_LPTIM5)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(F, 3, USART11_TX, GPIO_AF7_USART11)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 4, FMC_A4, GPIO_AF12_FMC)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(F, 4, LPTIM3_ETR, GPIO_AF2_LPTIM3)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(F, 4, USART11_RX, GPIO_AF7_USART11)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(F, 5, FMC_A5, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(F, 5, I2C4_SCL, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(F, 5, I3C1_SCL, GPIO_AF5_I3C1)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(F, 5, LPTIM3_CH1, GPIO_AF2_LPTIM3)
#endif
#ifdef LPTIM3
STM32_PIN_FUN_CFG(F, 5, LPTIM3_IN1, GPIO_AF14_LPTIM3)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(F, 5, UART12_RX, GPIO_AF6_UART12)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(F, 5, USART11_CTS, GPIO_AF7_USART11)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(F, 5, USART11_NSS, GPIO_AF7_USART11)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 6, LPTIM5_CH1, GPIO_AF13_LPTIM5)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(F, 6, OCTOSPI1_IO3, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(F, 6, SAI1_SD_B, GPIO_AF6_SAI1)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(F, 6, SPI5_NSS, GPIO_AF5_SPI5)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(F, 6, TIM16_CH1, GPIO_AF1_TIM16)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(F, 6, UART7_RX, GPIO_AF7_UART7)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 7, LPTIM5_CH2, GPIO_AF13_LPTIM5)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(F, 7, OCTOSPI1_IO2, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(F, 7, SAI1_MCLK_B, GPIO_AF6_SAI1)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(F, 7, SPI5_SCK, GPIO_AF5_SPI5)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(F, 7, TIM17_CH1, GPIO_AF1_TIM17)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(F, 7, UART7_TX, GPIO_AF7_UART7)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 8, LPTIM5_IN1, GPIO_AF13_LPTIM5)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(F, 8, OCTOSPI1_IO0, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(F, 8, SAI1_SCK_B, GPIO_AF6_SAI1)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(F, 8, SPI5_MISO, GPIO_AF5_SPI5)
#endif
#ifdef TIM13
STM32_PIN_FUN_CFG(F, 8, TIM13_CH1, GPIO_AF9_TIM13)
#endif
#ifdef TIM16
STM32_PIN_FUN_CFG(F, 8, TIM16_CH1N, GPIO_AF1_TIM16)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(F, 8, UART7_DE, GPIO_AF7_UART7)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(F, 8, UART7_RTS, GPIO_AF7_UART7)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(F, 9, LPTIM5_IN2, GPIO_AF13_LPTIM5)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(F, 9, OCTOSPI1_IO1, GPIO_AF10_OCTOSPI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(F, 9, SAI1_FS_B, GPIO_AF6_SAI1)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(F, 9, SPI5_MOSI, GPIO_AF5_SPI5)
#endif
#ifdef TIM14
STM32_PIN_FUN_CFG(F, 9, TIM14_CH1, GPIO_AF9_TIM14)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(F, 9, TIM17_CH1N, GPIO_AF1_TIM17)
#endif
#ifdef UART7
STM32_PIN_FUN_CFG(F, 9, UART7_CTS, GPIO_AF7_UART7)
#endif
#endif /* GPIOF */

