apache/mynewt-core/hw/mcu/stm/stm32h5xx/include/mcu/stm32_pin_cfg.h
/* Port G definitions */
#ifdef GPIOG
#ifdef FMC
STM32_PIN_FUN_CFG(G, 0, FMC_A10, GPIO_AF12_FMC)
#endif
#ifdef LPTIM4
STM32_PIN_FUN_CFG(G, 0, LPTIM4_IN1, GPIO_AF14_LPTIM4)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(G, 0, UART9_RX, GPIO_AF11_UART9)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 1, FMC_A11, GPIO_AF12_FMC)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(G, 1, I2S2_SDO, GPIO_AF7_SPI2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(G, 1, SPI2_MOSI, GPIO_AF7_SPI2)
#endif
#ifdef UART9
STM32_PIN_FUN_CFG(G, 1, UART9_TX, GPIO_AF11_UART9)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 10, DCMI_D2, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 10, FMC_NE3, GPIO_AF12_FMC)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(G, 10, I2S1_WS, GPIO_AF5_SPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 10, PSSI_D2, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(G, 10, SAI2_SD_B, GPIO_AF10_SAI2)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(G, 10, SDMMC2_D1, GPIO_AF11_SDMMC2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(G, 10, SPI1_NSS, GPIO_AF5_SPI1)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 11, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(G, 11, ETH_TX_EN, GPIO_AF11_ETH)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(G, 11, I2S1_CK, GPIO_AF5_SPI1)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(G, 11, LPTIM1_IN2, GPIO_AF1_LPTIM1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 11, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(G, 11, SDMMC2_D2, GPIO_AF10_SDMMC2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(G, 11, SPI1_SCK, GPIO_AF5_SPI1)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 11, USART10_RX, GPIO_AF6_USART10)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(G, 11, USART11_DE, GPIO_AF7_USART11)
#endif
#ifdef USART11
STM32_PIN_FUN_CFG(G, 11, USART11_RTS, GPIO_AF7_USART11)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 12, DCMI_D11, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(G, 12, ETH_TXD1, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 12, FMC_NE4, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(G, 12, LPTIM1_IN1, GPIO_AF1_LPTIM1)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(G, 12, LPTIM5_CH1, GPIO_AF14_LPTIM5)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 12, PSSI_D11, GPIO_AF13_PSSI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 12, PSSI_D15, GPIO_AF4_PSSI)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(G, 12, SDMMC2_D3, GPIO_AF10_SDMMC2)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(G, 12, SPI6_MISO, GPIO_AF5_SPI6)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 12, USART10_TX, GPIO_AF6_USART10)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 12, USART6_DE, GPIO_AF7_USART6)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 12, USART6_RTS, GPIO_AF7_USART6)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(G, 13, ETH_TXD0, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 13, FMC_A24, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(G, 13, LPTIM1_CH1, GPIO_AF1_LPTIM1)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(G, 13, LPTIM5_CH2, GPIO_AF13_LPTIM5)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(G, 13, SDMMC2_D6, GPIO_AF10_SDMMC2)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(G, 13, SPI6_SCK, GPIO_AF5_SPI6)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 13, USART10_CTS, GPIO_AF6_USART10)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 13, USART10_NSS, GPIO_AF6_USART10)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 13, USART6_CTS, GPIO_AF7_USART6)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 13, USART6_NSS, GPIO_AF7_USART6)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(G, 14, ETH_TXD1, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 14, FMC_A25, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(G, 14, LPTIM1_CH2, GPIO_AF4_LPTIM1)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(G, 14, LPTIM1_ETR, GPIO_AF1_LPTIM1)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(G, 14, LPTIM5_IN1, GPIO_AF13_LPTIM5)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(G, 14, OCTOSPI1_IO7, GPIO_AF9_OCTOSPI1)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(G, 14, SDMMC2_D7, GPIO_AF10_SDMMC2)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(G, 14, SPI6_MOSI, GPIO_AF5_SPI6)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 14, USART10_DE, GPIO_AF6_USART10)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 14, USART10_RTS, GPIO_AF6_USART10)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 14, USART6_TX, GPIO_AF7_USART6)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 15, DCMI_D13, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 15, FMC_SDNCAS, GPIO_AF12_FMC)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 15, PSSI_D13, GPIO_AF13_PSSI)
#endif
#ifdef SPI4
STM32_PIN_FUN_CFG(G, 15, SPI4_RDY, GPIO_AF5_SPI4)
#endif
#ifdef USART10
STM32_PIN_FUN_CFG(G, 15, USART10_CK, GPIO_AF6_USART10)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 15, USART6_CTS, GPIO_AF7_USART6)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 15, USART6_NSS, GPIO_AF7_USART6)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 2, FMC_A12, GPIO_AF12_FMC)
#endif
#ifdef LPTIM6
STM32_PIN_FUN_CFG(G, 2, LPTIM6_ETR, GPIO_AF14_LPTIM6)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(G, 2, TIM8_BKIN, GPIO_AF3_TIM8)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(G, 2, UART12_RX, GPIO_AF7_UART12)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 3, FMC_A13, GPIO_AF12_FMC)
#endif
#ifdef LPTIM5
STM32_PIN_FUN_CFG(G, 3, LPTIM5_ETR, GPIO_AF13_LPTIM5)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(G, 3, TIM8_BKIN2, GPIO_AF3_TIM8)
#endif
#ifdef UART12
STM32_PIN_FUN_CFG(G, 3, UART12_TX, GPIO_AF7_UART12)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 4, FMC_A14, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 4, FMC_BA0, GPIO_AF12_FMC)
#endif
#ifdef LPTIM4
STM32_PIN_FUN_CFG(G, 4, LPTIM4_ETR, GPIO_AF14_LPTIM4)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(G, 4, TIM1_BKIN2, GPIO_AF1_TIM1)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 5, FMC_A15, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 5, FMC_BA1, GPIO_AF12_FMC)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(G, 5, TIM1_ETR, GPIO_AF1_TIM1)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 6, DCMI_D12, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 6, FMC_NE3, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(G, 6, I2C4_SDA, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(G, 6, I3C1_SDA, GPIO_AF3_I3C1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(G, 6, OCTOSPI1_NCS, GPIO_AF10_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 6, PSSI_D12, GPIO_AF13_PSSI)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(G, 6, SPI1_RDY, GPIO_AF5_SPI1)
#endif
#ifdef TIM17
STM32_PIN_FUN_CFG(G, 6, TIM17_BKIN, GPIO_AF1_TIM17)
#endif
#ifdef UCPD1
STM32_PIN_FUN_CFG(G, 6, UCPD1_FRSTX, GPIO_AF11_UCPD1)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 7, DCMI_D13, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 7, FMC_INT, GPIO_AF12_FMC)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(G, 7, I2C4_SCL, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(G, 7, I3C1_SCL, GPIO_AF3_I3C1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 7, PSSI_D13, GPIO_AF13_PSSI)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(G, 7, SAI1_CK2, GPIO_AF2_SAI1)
#endif
#ifdef SAI1
STM32_PIN_FUN_CFG(G, 7, SAI1_MCLK_A, GPIO_AF6_SAI1)
#endif
#ifdef UCPD1
STM32_PIN_FUN_CFG(G, 7, UCPD1_FRSTX, GPIO_AF11_UCPD1)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 7, USART6_CK, GPIO_AF7_USART6)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(G, 8, ETH_PPS_OUT, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 8, FMC_SDCLK, GPIO_AF12_FMC)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(G, 8, SPI6_NSS, GPIO_AF5_SPI6)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(G, 8, TIM8_ETR, GPIO_AF3_TIM8)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 8, USART6_DE, GPIO_AF7_USART6)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 8, USART6_RTS, GPIO_AF7_USART6)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(G, 9, DCMI_VSYNC, GPIO_AF13_DCMI)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 9, FMC_NCE, GPIO_AF12_FMC)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(G, 9, FMC_NE2, GPIO_AF12_FMC)
#endif
#ifdef I2S1
STM32_PIN_FUN_CFG(G, 9, I2S1_SDI, GPIO_AF5_SPI1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(G, 9, OCTOSPI1_IO6, GPIO_AF9_OCTOSPI1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(G, 9, PSSI_RDY, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(G, 9, SAI2_FS_B, GPIO_AF10_SAI2)
#endif
#ifdef SDMMC2
STM32_PIN_FUN_CFG(G, 9, SDMMC2_D0, GPIO_AF11_SDMMC2)
#endif
#ifdef SPI1
STM32_PIN_FUN_CFG(G, 9, SPI1_MISO, GPIO_AF5_SPI1)
#endif
#ifdef USART6
STM32_PIN_FUN_CFG(G, 9, USART6_RX, GPIO_AF7_USART6)
#endif
#endif /* GPIOG */

