apache/mynewt-core/hw/mcu/stm/stm32h5xx/include/mcu/stm32_pin_cfg.h
/* Port H definitions */
#if defined(GPIOH) && !defined(STM32H5)
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 10, DCMI_D1, GPIO_AF13_DCMI)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(H, 10, I2C4_SMBA, GPIO_AF4_I2C4)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 10, PSSI_D1, GPIO_AF13_PSSI)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 10, SPI5_RDY, GPIO_AF5_SPI5)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 10, TIM1_CH1N, GPIO_AF1_TIM1)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(H, 10, TIM5_CH1, GPIO_AF2_TIM5)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 10, TIM8_CH3, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 11, DCMI_D2, GPIO_AF13_DCMI)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(H, 11, I2C4_SCL, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(H, 11, I3C1_SCL, GPIO_AF5_I3C1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 11, PSSI_D2, GPIO_AF13_PSSI)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 11, TIM1_CH1, GPIO_AF1_TIM1)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(H, 11, TIM5_CH2, GPIO_AF2_TIM5)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 11, TIM8_CH3N, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 12, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef I2C4
STM32_PIN_FUN_CFG(H, 12, I2C4_SDA, GPIO_AF4_I2C4)
#endif
#ifdef I3C1
STM32_PIN_FUN_CFG(H, 12, I3C1_SDA, GPIO_AF5_I3C1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 12, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 12, TIM1_BKIN, GPIO_AF1_TIM1)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(H, 12, TIM5_CH3, GPIO_AF2_TIM5)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 12, TIM8_BKIN, GPIO_AF3_TIM8)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 12, TIM8_CH4N, GPIO_AF10_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 13, DCMI_D3, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(H, 13, FDCAN1_TX, GPIO_AF9_FDCAN1)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(H, 13, LPTIM1_IN2, GPIO_AF1_LPTIM1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 13, PSSI_D3, GPIO_AF13_PSSI)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 13, TIM8_CH1N, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(H, 13, UART4_TX, GPIO_AF8_UART4)
#endif
#ifdef UART8
STM32_PIN_FUN_CFG(H, 13, UART8_TX, GPIO_AF7_UART8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 14, DCMI_D4, GPIO_AF13_DCMI)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(H, 14, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 14, PSSI_D4, GPIO_AF13_PSSI)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 14, TIM8_CH2N, GPIO_AF3_TIM8)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(H, 14, UART4_RX, GPIO_AF8_UART4)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 15, DCMI_D11, GPIO_AF13_DCMI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 15, PSSI_D11, GPIO_AF13_PSSI)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 15, TIM8_CH3N, GPIO_AF3_TIM8)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(H, 2, ETH_CRS, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(H, 2, FMC_SDCKE0, GPIO_AF12_FMC)
#endif
#ifdef LPTIM1
STM32_PIN_FUN_CFG(H, 2, LPTIM1_IN2, GPIO_AF1_LPTIM1)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(H, 2, OCTOSPI1_IO4, GPIO_AF9_OCTOSPI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(H, 2, SAI2_SCK_B, GPIO_AF10_SAI2)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(H, 3, ETH_COL, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(H, 3, FMC_SDNE0, GPIO_AF12_FMC)
#endif
#ifdef OCTOSPI1
STM32_PIN_FUN_CFG(H, 3, OCTOSPI1_IO5, GPIO_AF9_OCTOSPI1)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(H, 3, SAI2_MCLK_B, GPIO_AF10_SAI2)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(H, 4, I2C2_SCL, GPIO_AF4_I2C2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 4, PSSI_D14, GPIO_AF13_PSSI)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 4, SPI5_RDY, GPIO_AF5_SPI5)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(H, 4, SPI6_RDY, GPIO_AF7_SPI6)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(H, 5, FMC_SDNWE, GPIO_AF12_FMC)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(H, 5, I2C2_SDA, GPIO_AF4_I2C2)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 5, SPI5_NSS, GPIO_AF5_SPI5)
#endif
#ifdef SPI6
STM32_PIN_FUN_CFG(H, 5, SPI6_RDY, GPIO_AF7_SPI6)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 6, DCMI_D8, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(H, 6, ETH_RXD2, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(H, 6, FMC_SDNE1, GPIO_AF12_FMC)
#endif
#ifdef I2C2
STM32_PIN_FUN_CFG(H, 6, I2C2_SMBA, GPIO_AF4_I2C2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 6, PSSI_D8, GPIO_AF13_PSSI)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 6, SPI5_SCK, GPIO_AF5_SPI5)
#endif
#ifdef TIM12
STM32_PIN_FUN_CFG(H, 6, TIM12_CH1, GPIO_AF2_TIM12)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 6, TIM1_CH3N, GPIO_AF1_TIM1)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 6, TIM8_CH1, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 7, DCMI_D9, GPIO_AF13_DCMI)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(H, 7, ETH_RXD3, GPIO_AF11_ETH)
#endif
#ifdef FMC
STM32_PIN_FUN_CFG(H, 7, FMC_SDCKE1, GPIO_AF12_FMC)
#endif
#ifdef I2C3
STM32_PIN_FUN_CFG(H, 7, I2C3_SCL, GPIO_AF4_I2C3)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 7, PSSI_D9, GPIO_AF13_PSSI)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 7, SPI5_MISO, GPIO_AF5_SPI5)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 7, TIM1_CH3, GPIO_AF1_TIM1)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 7, TIM8_CH1N, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 8, DCMI_HSYNC, GPIO_AF13_DCMI)
#endif
#ifdef I2C3
STM32_PIN_FUN_CFG(H, 8, I2C3_SDA, GPIO_AF4_I2C3)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 8, PSSI_DE, GPIO_AF13_PSSI)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 8, SPI5_MOSI, GPIO_AF5_SPI5)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 8, TIM1_CH2N, GPIO_AF1_TIM1)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(H, 8, TIM5_ETR, GPIO_AF2_TIM5)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 8, TIM8_CH2, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(H, 9, DCMI_D0, GPIO_AF13_DCMI)
#endif
#ifdef I2C3
STM32_PIN_FUN_CFG(H, 9, I2C3_SMBA, GPIO_AF4_I2C3)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(H, 9, PSSI_D0, GPIO_AF13_PSSI)
#endif
#ifdef SPI5
STM32_PIN_FUN_CFG(H, 9, SPI5_NSS, GPIO_AF5_SPI5)
#endif
#ifdef TIM12
STM32_PIN_FUN_CFG(H, 9, TIM12_CH2, GPIO_AF2_TIM12)
#endif
#ifdef TIM1
STM32_PIN_FUN_CFG(H, 9, TIM1_CH2, GPIO_AF1_TIM1)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(H, 9, TIM8_CH2N, GPIO_AF3_TIM8)
#endif
#endif /* GPIOH */

/* Port I definitions */
#ifdef GPIOI
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 0, DCMI_D13, GPIO_AF13_DCMI)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(I, 0, I2S2_WS, GPIO_AF5_SPI2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 0, PSSI_D13, GPIO_AF13_PSSI)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(I, 0, SPI2_NSS, GPIO_AF5_SPI2)
#endif
#ifdef TIM5
STM32_PIN_FUN_CFG(I, 0, TIM5_CH4, GPIO_AF2_TIM5)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 1, DCMI_D8, GPIO_AF13_DCMI)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(I, 1, I2S2_CK, GPIO_AF5_SPI2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 1, PSSI_D8, GPIO_AF13_PSSI)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(I, 1, SPI2_SCK, GPIO_AF5_SPI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 1, TIM8_BKIN2, GPIO_AF3_TIM8)
#endif
#ifdef ETH
STM32_PIN_FUN_CFG(I, 10, ETH_RX_ER, GPIO_AF11_ETH)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(I, 10, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 10, PSSI_D14, GPIO_AF13_PSSI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 11, PSSI_D15, GPIO_AF13_PSSI)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 2, DCMI_D9, GPIO_AF13_DCMI)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(I, 2, I2S2_SDI, GPIO_AF5_SPI2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 2, PSSI_D9, GPIO_AF13_PSSI)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(I, 2, SPI2_MISO, GPIO_AF5_SPI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 2, TIM8_CH4, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 3, DCMI_D10, GPIO_AF13_DCMI)
#endif
#ifdef I2S2
STM32_PIN_FUN_CFG(I, 3, I2S2_SDO, GPIO_AF5_SPI2)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 3, PSSI_D10, GPIO_AF13_PSSI)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(I, 3, SPI2_MOSI, GPIO_AF5_SPI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 3, TIM8_ETR, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 4, DCMI_D5, GPIO_AF13_DCMI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 4, PSSI_D5, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(I, 4, SAI2_MCLK_A, GPIO_AF10_SAI2)
#endif
#ifdef SPI2
STM32_PIN_FUN_CFG(I, 4, SPI2_RDY, GPIO_AF7_SPI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 4, TIM8_BKIN, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 5, DCMI_VSYNC, GPIO_AF13_DCMI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 5, PSSI_RDY, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(I, 5, SAI2_SCK_A, GPIO_AF10_SAI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 5, TIM8_CH1, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 6, DCMI_D6, GPIO_AF13_DCMI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 6, PSSI_D6, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(I, 6, SAI2_SD_A, GPIO_AF10_SAI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 6, TIM8_CH2, GPIO_AF3_TIM8)
#endif
#ifdef DCMI
STM32_PIN_FUN_CFG(I, 7, DCMI_D7, GPIO_AF13_DCMI)
#endif
#ifdef PSSI
STM32_PIN_FUN_CFG(I, 7, PSSI_D7, GPIO_AF13_PSSI)
#endif
#ifdef SAI2
STM32_PIN_FUN_CFG(I, 7, SAI2_FS_A, GPIO_AF10_SAI2)
#endif
#ifdef TIM8
STM32_PIN_FUN_CFG(I, 7, TIM8_CH3, GPIO_AF3_TIM8)
#endif
#ifdef FDCAN1
STM32_PIN_FUN_CFG(I, 9, FDCAN1_RX, GPIO_AF9_FDCAN1)
#endif
#ifdef UART4
STM32_PIN_FUN_CFG(I, 9, UART4_RX, GPIO_AF8_UART4)
#endif
#endif /* GPIOI */

#ifdef __cplusplus
}
#endif

#endif /* _STM32_PIN_CFG_H */
